app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("user_id", "fname", "lname", "total_games_played", "blob_games_played", "blob_games_won", "blob_games_lost", "blob_game_high_score", "ogre_games_played", "ogre_games_won", "ogre_games_lost", "ogre_game_high_score", "sky_games_played", "sky_game_high_score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save